Jacsean/EspNav/Esp32S3/sdkconfig.defaults
# ESP32-S3 N16R8 集成板（实测：ESP32-S3 rev v0.2 / 16MB flash / 8MB 内嵌 PSRAM / USB-Serial-JTAG）
CONFIG_IDF_TARGET="esp32s3"

# Flash：16MB（默认 2MB 会导致 "Detected size larger than image header" 告警）
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# 自定义分区表（factory 4MB + 字库分区 1MB）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM：启用（实机实测正常：octal_psram Found 8MB PSRAM device）
# 为什么启用：帧缓冲 150KB 放 PSRAM，给内部 SRAM 留余量（地图底图 / JPEG 解码都要用）；
# lcd_fb 的分配策略是"优先 PSRAM、回退内部 SRAM"，所以两侧都能跑。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y

# 控制台走内置 USB-Serial/JTAG（板上仅此一个 USB 口；默认 UART0 未引出）
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
